/* No comment provided by engineer. */
"msg_error_check_network_try_again" = "Check your network connection and try again please.";

/* Settings menu text */
"settings_menu_clear_words" = "Clear Words (%d)";

"error_title_generic" = "Oops! Something Went Wrong";

/* No comment provided by engineer. */
"msg_error_create_word_set" = "Could not create sets of words.";

/* Error shown when manually adedd words could not be imported. */
"error_msg_words_added" = "Could not add words, please contact support to fix this";

/* Feedback message when words are manually added and have been successfully imported */
"msg_words_added" = "%d words added!";

"msg_create_word_set_none" = "No new word sets were created";

/* No comment provided by engineer. */
"msg_error_delete_words" = "Could Not Delete Words";

"msg_error_baby_save" = "Could save baby";


/* No comment provided by engineer. */
"error_title_download_word_list" = "Could not initialize word list";

/* Error message when the word list could not be downloaded */
"error_msg_download_word_list" = "You must be connected to the internet to download the initial word list. Try again after you ensure that you have an internet connection";

/* Confirmation prompt when abort lesson is pressed */
"prompt_title_abort_lesson" = "Really?";
"prompt_msg_abort_lesson" = "Do you really want to abort the current lesson?";
"prompt_button_no" = "No";
"prompt_button_yes" = "Yes";

"msg_error_no_wordsets" = "Please go to settings and load some words";

/* No comment provided by engineer. */
"msg_success_create_word_sets" = "Created %d sets of words.";

/* No comment provided by engineer. */
"msg_success_delete_words" = "Deleted all words.";

/* Label in the settings pane for reminder inverval */
"settings_label_reminder" = "Every %d mins";

/* Message for alert box after words have been imported */
"msg_success_import_words" = "Imported %d new words";

///////////////////// Lesson info shown in DetailViewController /////////////////////
/* Text shown in main detail view for how many lessons for today have been completed */
"msg_lessons_completed_today" = "%d of %d lessons done today!";
////////////////////////////////////////////////////////////////////


///////////////////// Notifications shown in DetailViewController/NotificationDisplayViewController /////////////////////
"notification_increase_sets_for_program_day_title" = "It's time to increase the number of word sets";
"notification_increase_sets_for_program_day_msg" = "If you feel like you baby is ready, then it's time increase the number of word sets you are using to %d. This can be done under Settings.";

"alert_words_low_title" = "You are running low on availble words!";
"alert_words_low_msg" = "Go to the Words menu, and touch Add to add some more words as soon as possible.";

"alert_words_out_title" = "No more availble words! Some lessons will have fewer words.";
"alert_words_out_msg" = "Go to the Words menu, and touch Add to add some more words as soon as possible.";
////////////////////////////////////////////////////////////////////


///////////////////// LessonsListViewController /////////////////////
/* Shown in the Next Lesson cell, to indicate when the next lesson is dues */
"lesson_due_now" = "Ready to start!";
"lesson_due_tommorrow" = "Will be ready tomorrow morning";
"lesson_due_in_time" = "Will be ready in %@";

"lesson_past_taken_at_and_duration" = "%@. Lasted %@ seconds";

"lesson_header_next_lesson" = "Next Lesson";
"lesson_header_past_lessons" = "Past Lessons";

"lesson_no_more_words_title" = "You are out of words!";
"lesson_no_more_words" = "To continue you must add more words.";
////////////////////////////////////////////////////////////////////

///////////////////// WebViewController /////////////////////
"web_view_load_failed" = "Could not load the requested information. Check your internet connection then try again.";
////////////////////////////////////////////////////////////////////



/* Cancel/Accept button title */
"uialert_accept_button_title" = "Ok";

/* No comment provided by engineer. */
"error_title_reminders_cannot_be_sent" = "Reminders Can Not Be Sent";

/* The side prompt shown in local notification */
"local_notification_reminder_alert_action" = "Slide to start lesson now";

/* Main message shown in local notification */
"local_notification_reminder_alert_body" = "Time for a reading Lesson!";

/* No comment provided by engineer. */
"success_title_generic" = "Success!";

/* No comment provided by engineer. */
"msg_error_activate_alerts" = "You have previously denied permision to send notifications to the EarlyReader App. You must go to iOS Settings->Notification Center->EarlyReader and allow notifications if you want recieve reminders.";

/* In the word list table, the number of words in the section header */
"word_list_section_number_of_words" = "%d words";

/* In the word list table, section header title */
"word_list_word_group_in_word_set" = "In Set";

/* In the word list table, section header title */
"word_list_word_group_retired" = "Retired";

/* In the word list table, section header title */
"word_list_word_group_available" = "Available";

/* Label in the settings pane for number of WordSets */
"settings_label_number_of_wordsets" = "Using %d sets of words";

/* Label in the settings pane for slide advance inverval seconds */
"settings_label_slide_advance" = "%.1f seconds";

/* Label in the settings pane for slide advance manual mode */
"settings_label_slide_advance_manual" = "Manual";

/* Label in the settings pane to display the current baby's info */
"settings_baby_info" = "%@ is %@ old";
